In [8]:
import pandas as pd

# Series

In [9]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
index_s = ['a', 'b','c' , 'd', 'e']
ser = pd.Series([1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
ser[0],ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_14760\143202658.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0],ser['a']

(np.int64(1), np.int64(1))

In [12]:
dict_data = {'a': 1, 'b': 2, 'c': 3, 'e':4}
s3 = pd.Series(dict_data)
print(s3)

a    1
b    2
c    3
e    4
dtype: int64

In [13]:
ser2 = pd.Series([10, 'banana'])
ser2

0        10
1    banana
dtype: object

In [14]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 0,1 펜시인덱싱

9776
서울    9776
부산    2729
dtype: int64

In [15]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [16]:
ser.iloc[0], ser.loc['a']

(np.int64(1), np.int64(1))

# 데이터프레임

In [17]:
import pandas as pd
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [18]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [19]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [20]:
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [21]:
scientists.index = ['Rosaline Franklin','William Gosset' ]

In [22]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [23]:
# [형, 열] 인덱싱
scientists.loc['William Gosset' , 'Born']

'1876-06-13'

iloc[] : indexlocator<br>
loc[] : locator

In [24]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]


# 행, 열 이름 지정하여 생성
df = pd.DataFrame(data, columns=['A', 'B', 'C'], index=['가','나','다'])
print(df)

   A  B  C
가  1  2  3
나  4  5  6
다  7  8  9

In [25]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

In [57]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [27]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [51]:
sci1.loc[0,'Name']  #[row, col] 인덱싱

'Rosaline Franklin'

In [58]:
sci1.iloc[1,4]

np.int64(61)

In [60]:
# born, died 만 추출
sci1.iloc[:,2:4]

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [61]:
sci1.iloc[:,1]

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [29]:
print(sci1.loc[0, 'Name'])
print(sci1.loc[0, 'Occupation'])

Rosaline Franklin
Chemist

In [30]:
sci1.to_csv('./data/scientist_1.csv')

In [31]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [32]:
# pickle : 파이썬의 객체형을 저장
sci1.to_pickle('./data/scientist.pickle')

In [33]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [34]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [35]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [36]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

# 데이터 미리보기
1. info()
2. head()/tail()

In [37]:
df1.head(1)     #defaults = 5개

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist

In [38]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [39]:
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [40]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [41]:
df1.loc[:,'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [42]:
# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

# 처음 5개 행 보기
print("=== head() ===")
print(df.head())

# 마지막 3개 행 보기
print("\n=== tail(3) ===")
print(df.tail(3))

# 데이터프레임 기본 정보
print("\n=== info() ===")
print(df.info())

# 기술 통계량
print("\n=== describe() ===")
print(df.describe())

=== head() ===
    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

=== tail(3) ===
    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

=== info() ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes
None

=== describe() ===
              나이         점수
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [43]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [44]:
df.columns

Index(['이름', '나이', '점수'], dtype='object')

In [45]:
df.shape

(7, 3)

In [46]:
df.values

array([['김철수', 25, 85],
       ['이영희', 28, 92],
       ['박민수', 22, 78],
       ['정수진', 31, 95],
       ['최영호', 27, 88],
       ['한미래', 24, 73],
       ['윤지원', 29, 91]], dtype=object)

In [47]:
gapminder = pd.read_csv('./data/gapminder.tsv', sep='\t')
gapminder

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [48]:
gapminder.head(3)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

In [49]:
gapminder[['country','continent','year']]

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [50]:
print(gapminder.iloc[0])     
print('-'*50)        
print(gapminder.iloc[99])
print('-'*50)    
print(gapminder.iloc[-1])

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object
--------------------------------------------------
country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object
--------------------------------------------------
country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

# 행,열 추가

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [70]:
# 컬럼목록을 변경
df.columns = ['Name', 'Age', 'Score']
df.index = ['A', 'B', 'C', 'D', 'E' , 'F', 'G']
df

  Name  Age  Score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [76]:
# 일부 열의 이름 변경
df.rename( columns= {'Name': 'N', 'Age':'A', 'Score':'S'})
df.rename( index= {'A': 'kim'})
# 일부 행의 이름 소문자 변경
df.rename(index={'A': "a"})
df

  Name  Age  Score
a  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [79]:
df.rename( index={'a' :'A'}, inplace= True)

In [82]:
df.iloc[0]  #행단위 인덱싱

Name     김철수
Age       25
Score     85
Name: A, dtype: object

In [ ]:
df.iloc[0:2]   #행단위 슬라이싱 -1

  Name  Age  Score
A  김철수   25     85
B  이영희   28     92

In [ ]:
df.loc['A']

Name     김철수
Age       25
Score     85
Name: A, dtype: object

In [ ]:
df[df['Age']>25]    #조건을 사용한 행 추출

  Name  Age  Score
B  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91

In [92]:
# 점수가 90점 이상만 
df[df['Score']>=90]

  Name  Age  Score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [98]:
#새로운 행 추가 > loc[]를 이용
df.loc[7] =['홍길동', 30 ,70]
df

  Name  Age  Score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91
7  홍길동   30     70

In [115]:
#열추가
df['Grade'] = ['B','A','C','A','B','C','A','C']

In [119]:
# 열이름 변경
df.insert(loc=1, column='s_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', '5008'])
df

  Name  s_id student_id  Age  Score 등급 Grade
A  김철수  S001       S001   25     85  B     B
B  이영희  S002       S002   28     92  A     A
C  박민수  S003       S003   22     78  C     C
D  정수진  S004       S004   31     95  A     A
E  최영호  S005       S005   27     88  B     B
F  한미래  S006       S006   24     73  C     C
G  윤지원  S007       S007   29     91  A     A
7  홍길동  5008       5008   30     70  C     C

In [125]:

df.drop('등급',axis=1,inplace=True)

In [134]:
df.drop(7, axis=0, inplace=True)

In [135]:
df

  Name  s_id  Age  Score Grade
A  김철수  S001   25     85     B
B  이영희  S002   28     92     A
C  박민수  S003   22     78     C
D  정수진  S004   31     95     A
E  최영호  S005   27     88     B
F  한미래  S006   24     73     C
G  윤지원  S007   29     91     A

In [137]:
df.drop(columns={df.columns[4]},axis=1)

  Name  s_id  Age  Score
A  김철수  S001   25     85
B  이영희  S002   28     92
C  박민수  S003   22     78
D  정수진  S004   31     95
E  최영호  S005   27     88
F  한미래  S006   24     73
G  윤지원  S007   29     91

In [138]:
df

  Name  s_id  Age  Score Grade
A  김철수  S001   25     85     B
B  이영희  S002   28     92     A
C  박민수  S003   22     78     C
D  정수진  S004   31     95     A
E  최영호  S005   27     88     B
F  한미래  S006   24     73     C
G  윤지원  S007   29     91     A

In [153]:
# 일주일치 날짜 인덱스 생성
dates = pd.date_range('2025-06-01', periods=7, freq='D')
print(dates)

# 월별 날짜 인덱스 생성
monthly_dates = pd.date_range('2025-01-01', periods=12, freq='M')
print(monthly_dates)

DatetimeIndex(['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04',
               '2025-06-05', '2025-06-06', '2025-06-07'],
              dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2025-01-31', '2025-02-28', '2025-03-31', '2025-04-30',
               '2025-05-31', '2025-06-30', '2025-07-31', '2025-08-31',
               '2025-09-30', '2025-10-31', '2025-11-30', '2025-12-31'],
              dtype='datetime64[ns]', freq='ME')

C:\Users\Admin\AppData\Local\Temp\ipykernel_14760\2086838407.py:6: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_dates = pd.date_range('2025-01-01', periods=12, freq='M')

In [142]:
# 객체를 숫자형으로 변환
df = df.astype({'Age': int, 'Score': float})

# 문자열로 변환
df['s_id'] = df['s_id'].astype(str)

df

  Name  s_id  Age  Score Grade
A  김철수  S001   25   85.0     B
B  이영희  S002   28   92.0     A
C  박민수  S003   22   78.0     C
D  정수진  S004   31   95.0     A
E  최영호  S005   27   88.0     B
F  한미래  S006   24   73.0     C
G  윤지원  S007   29   91.0     A

In [144]:
df_id = df.set_index('s_id')

In [145]:
df_id

     Name  Age  Score Grade
s_id
S001  김철수   25   85.0     B
S002  이영희   28   92.0     A
S003  박민수   22   78.0     C
S004  정수진   31   95.0     A
S005  최영호   27   88.0     B
S006  한미래   24   73.0     C
S007  윤지원   29   91.0     A

In [146]:
df

  Name  s_id  Age  Score Grade
A  김철수  S001   25   85.0     B
B  이영희  S002   28   92.0     A
C  박민수  S003   22   78.0     C
D  정수진  S004   31   95.0     A
E  최영호  S005   27   88.0     B
F  한미래  S006   24   73.0     C
G  윤지원  S007   29   91.0     A

In [147]:
df_id.reset_index(inplace=True)
df_id

   s_id Name  Age  Score Grade
0  S001  김철수   25   85.0     B
1  S002  이영희   28   92.0     A
2  S003  박민수   22   78.0     C
3  S004  정수진   31   95.0     A
4  S005  최영호   27   88.0     B
5  S006  한미래   24   73.0     C
6  S007  윤지원   29   91.0     A

In [148]:
df

  Name  s_id  Age  Score Grade
A  김철수  S001   25   85.0     B
B  이영희  S002   28   92.0     A
C  박민수  S003   22   78.0     C
D  정수진  S004   31   95.0     A
E  최영호  S005   27   88.0     B
F  한미래  S006   24   73.0     C
G  윤지원  S007   29   91.0     A

In [154]:
df['date'] = dates

In [155]:
df

  Name  s_id  Age  Score Grade       date
A  김철수  S001   25   85.0     B 2025-06-01
B  이영희  S002   28   92.0     A 2025-06-02
C  박민수  S003   22   78.0     C 2025-06-03
D  정수진  S004   31   95.0     A 2025-06-04
E  최영호  S005   27   88.0     B 2025-06-05
F  한미래  S006   24   73.0     C 2025-06-06
G  윤지원  S007   29   91.0     A 2025-06-07

In [157]:
df_date = df.set_index('date')
df_date

           Name  s_id  Age  Score Grade
date
2025-06-01  김철수  S001   25   85.0     B
2025-06-02  이영희  S002   28   92.0     A
2025-06-03  박민수  S003   22   78.0     C
2025-06-04  정수진  S004   31   95.0     A
2025-06-05  최영호  S005   27   88.0     B
2025-06-06  한미래  S006   24   73.0     C
2025-06-07  윤지원  S007   29   91.0     A